dict = {
  "香港政府於2026年1月提出加強哪方面的監管？": "建築維修及消防安全",
  "中國載人航天工程辦公室在2026年2月底宣布，中國計劃在本年實施2次載人飛行任務及1次貨運飛船補給任務。來自哪裡的太空員有望最早於今年執行空間站飛行任務？": "港澳地區",
  "第35屆國際乒聯亞洲盃在哪個中國城市舉行？": "海口",
  "中國解放軍曾在2026年初進行哪類軍事練習？": "模擬「斬首行動」演習",
  "「 」首次登記稅寬減於2026年3月31日結束": "私家電動車",
  "路政署於2026年2月公布《香港鐵路標》，同時宣布正式成立「 」，以加快新鐵路項目的推展進程。": "鐵路審批組",
  "在2026巴塞羅那世界移動通信大會上，中國科技品牌「 」正式推出全球首款「機器人手機」。": "榮耀",
  "2026年度財政預算案提出推動「 」成為創科及先進製造業基地。": "北部都會區",
  "以下哪一場會議於2026年3月18日在香港舉行，以「匯聚全球智慧」為主題，促進教育、科技一體化發展，突顯香港作為國際樞紐及國家門戶的角色與優勢？": "全球人才高峰會",
  "以下哪一項是中國建材集團自主研發的T1200級超高強度物料？該物料具備極強的耐高溫與耐腐蝕能力，能廣泛應用於航空航天、人形機器人等產業。": "碳纖維",
  "香港政府宣布由2026年4月3日起，長者及合資格殘疾人士公共交通票價計劃，將劃一調整為以下哪一項優惠措施？": "兩蚊兩折",
  "「港話通」團隊將拓展多項實用功能，讓技術深度融入市民日常生活。以下哪一項不是「港話通」的功能？": "港論通",
  "「 」規劃綱要草案設港澳專章，以深化大灣區建設，強化科技創新等規則，並鞏固香港的國際金融、航運、貿易中心和國際航空樞紐地位。": "十五五",
  "香港政府於2026年3月23日刊憲，公布《香港國安法》第四十三條細則，包括「不遵從提供_____等要求屬犯罪」等條文，旨在強化偵查危害國家安全犯罪的能力。": "密碼",
  "國家市場監管總局於2026年3月30日發表關於進一步貫徹實施《中華人民共和國反不正當_____法》，以提升對網絡相關行為的常態化監管水平。": "競爭",
  "中國工業和信息化部、供銷合作總社在2026年4月聯合印發《關於進一步加強電動「 」鋰離子電池回收利用體系建設的通知》，旨在充分發揮再生資源回收利用網絡作用，推動鋰電池規範回收、科學利用。": "自行車"
}

import revisionHelper as rh
rh.ask_questions(dict)