dict = {
    "2025 年 9 月 3 日是中國人民抗日戰爭暨世界反法西斯戰爭勝利多少週年？": "80",
    "《全球創新指數》世界百強創新集群排行榜，旨在衡量全球各地不同城市群科技和創新能力。以下哪一集群於 2025 年首次登上榜首？": "深圳、香港、廣州",
    "2025 施政報告指出，教育局將成立專班，與大學教育資助委員會、創科局、海外經貿辦、駐內地辦事處等加強推廣香港高等教育。該專班的名稱是什麼？": "留學香港",
    "香港政府提出有關劏房單位的條例草案，引入安全與衞生規管制度。條例規定單位符合標準及取得「X」認證，方可合法作居住用途。X 是什麼？": "簡樸房",
    "香港發展局與教育局實行「______計劃」，鼓勵市場把整幢商廈改裝成宿舍，鞏固香港作為國際專上教育樞紐的地位。": "城中學舍",
    "香港特別行政區政府及貿發局合辦的第十屆「______高峰論壇」於 2025 年 9 月舉行，以「合作求變，共建未來」為主題，促進不同國家在商貿、創科、綠色發展方面的合作機遇。": "一帶一路",
    "______港深創科園（又稱港深創新及科技園）於 2025 年年底啟用，推動粵港澳大灣區創科樞紐建設。": "河套",
    "香港特首李家超提出成立「AI ______組」，負責統籌和指導政府部門，於工作中應用人工智能技術、研究重組工作流程及推動部門進行科技革新。": "效能提升",
    "故宮博物院建院 X 周年座談會於 2025 年 10 月 10 日在京舉行，中共中央政治局委員、中宣部部長李書磊出席會議並講話。X 是": "100",
    "誰人於 2025 年 10 月 9 日至 11 日率中國黨政代表團出席朝鮮勞動黨建黨 80 周年慶祝活動，並對朝鮮進行正式友好訪問？": "李強",
    "國家主席習近平於 2025 年 10 月 3 日與哪個國家的總統互致賀電，慶祝兩國建交 35 週年？": "新加坡",
    "誰人由 2025 年 10 月 27 日起出任政府物流服務署署長？": "郭黃穎琦",
    "______於 2025 年 10 月 14 日與重慶市教育委員會代表簽署渝港教育合作備忘錄，見證金文泰中學與重慶市育才中學締結成姊妹學校。": "蔡若蓮",
    "香港政府計劃 2025 年 11 月實施______，當中入境市區名額每日 100 個，每次可逗留三日。": "粵車南下",
    "新一份施政報告提出政府會推出容許狗隻進入的______牌照，希望為業界帶來全新商機。": "食肆",
    "首次由 ______ 三地共同承辦的第十五屆全國運動會和全國第十二屆殘疾人運動會暨第九屆特殊奧林匹克運動會，將分別於 2025 年 11 月 9 日及 12 月 8 日正式揭幕。": "粵港澳"
}
import revisionHelper as rh
rh.ask_questions(dict)  # Ask the user questions based on the dictionary