dict = {
    "我有事走先":"我有事先走。",
    "你食多啲，不要客氣":"你多吃點兒，不用客氣。",
    "你講少兩句行不行？":"你少說兩句行不行？",
    "老師俾一本書我。":"老師給我一本書。",
    "他長得高過我。":"他長得比我高。",
    "那個女演員漂亮到極。":"那個女演員標亮極了。",
    "你有吃過飯嗎？":"你吃了飯沒有？",
    "多謝你給機會我。":"謝謝你給我機會。",
    "他和嫲嫲去咗睇戲":"他和奶奶看電影去了。",
    "天涼了，穿多一件衣服吧！":"天氣涼了，多穿一件衣服吧！",
    "[]出貓, 失禮, 吝嗇, 落堂":"吝嗇",
    "[]強嘴, 收聲, 櫃桶, 穩陣":"強嘴",
    "[]乾濕褸, 縏領帶, 高踭鞋, 除眼鏡":"繫領帶",
    "[]冇得彈, 不捨得, 瞌眼瞓, 掌上壓":"不捨得",
    "阻手阻腳, 花哩花碌, 講返轉頭, 光說不做":"光說不做"
}

import revisionHelper as rh
rh.ask_questions(dict)  # Ask the user questions based on the dictionary